/// проект Зоогостинница
/// Работаем в консоле но проектируем программу 
/// в стиле ООП
///     Проект на несколько недель с отчётами в процессе 
///     производства
/// 
/// В предыдущих сериях
///     Перечень сущностей в зоогостинке
///         - Администратор
///         - Сотрудники(должности)
///         - Клиенты
///         - Питомцы(породы, предпочтения,...)
///         - Комнаты
///         - Места
///         - Договор
/// Процессы для первичной работы
///     - Зарегестрировать договор
///     - показ "заселённости" гостинницы
///     - внесение/забор питомца
///     * - отслеживание того какой сотрудник 
///         какое действие делал
/// Функциональные требования
///     - возможность существования комнат 
///       на нескольких адресах
///     * - возможность самостаятельной регистрации 
///         клиентов
///     * - отслеживание наличия корма и прочих хоз 
///         расходов в приложении

#include <iostream>
#include <string>
#include "./Utilities.hpp"



class Role
{

};



class Zoohotel
{

};

int main()
{

}